In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:poorvika22@localhost/test

In [2]:
%%sql
CREATE DATABASE StudentDB;
USE StudentDB;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.
0 rows affected.

[]

In [3]:
%%sql
CREATE TABLE Students (
    student_id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(100),
    class VARCHAR(20),
    dob DATE
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [4]:
%%sql
CREATE TABLE Subjects (
    subject_id INT PRIMARY KEY AUTO_INCREMENT,
    subject_name VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [5]:
%%sql
CREATE TABLE Marks (
    mark_id INT PRIMARY KEY AUTO_INCREMENT,
    student_id INT,
    subject_id INT,
    marks_obtained INT,
    FOREIGN KEY (student_id) REFERENCES Students(student_id),
    FOREIGN KEY (subject_id) REFERENCES Subjects(subject_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [6]:
%%sql
CREATE TABLE Attendance (
    attendance_id INT PRIMARY KEY AUTO_INCREMENT,
    student_id INT,
    date DATE,
    status ENUM('Present', 'Absent'),
    FOREIGN KEY (student_id) REFERENCES Students(student_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [7]:
%%sql
INSERT INTO Students (name, class, dob)
VALUES ('Sarathy', '12-A', '2003-07-27');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [8]:
%%sql
INSERT INTO Subjects (subject_name)
VALUES ('Math'), ('Science'), ('English');

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [9]:
%%sql
INSERT INTO Marks (student_id, subject_id, marks_obtained)
VALUES 
(1, 1, 88),
(1, 2, 72),
(1, 3, 91);

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [10]:
%%sql
INSERT INTO Attendance (student_id, date, status)
VALUES
(1, '2025-06-01', 'Present'),
(1, '2025-06-02', 'Absent'),
(1, '2025-06-03', 'Present');

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [11]:
%%sql
select * from Students;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1, 'Sarathy', '12-A', datetime.date(2003, 7, 27))]

In [12]:
%%sql
select * from Subjects;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 'Math'), (2, 'Science'), (3, 'English')]

In [13]:
%%sql
select * from Marks;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 1, 1, 88), (2, 1, 2, 72), (3, 1, 3, 91)]

In [14]:
%%sql
select * from Attendance;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 1, datetime.date(2025, 6, 1), 'Present'),
 (2, 1, datetime.date(2025, 6, 2), 'Absent'),
 (3, 1, datetime.date(2025, 6, 3), 'Present')]

In [15]:
%%sql
select * from Students;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1, 'Sarathy', '12-A', datetime.date(2003, 7, 27))]

In [17]:
%%sql
SELECT s.name, sub.subject_name, m.marks_obtained
FROM Marks m
JOIN Students s ON m.student_id = s.student_id
JOIN Subjects sub ON m.subject_id = sub.subject_id
WHERE s.name = 'Sarathy';

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Sarathy', 'Math', 88),
 ('Sarathy', 'Science', 72),
 ('Sarathy', 'English', 91)]

In [18]:
%%sql
SELECT s.name, a.date, a.status
FROM Attendance a
JOIN Students s ON a.student_id = s.student_id
WHERE s.name = 'Sarathy';

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Sarathy', datetime.date(2025, 6, 1), 'Present'),
 ('Sarathy', datetime.date(2025, 6, 2), 'Absent'),
 ('Sarathy', datetime.date(2025, 6, 3), 'Present')]

In [19]:
%%sql
SELECT s.name, AVG(m.marks_obtained) AS average_marks
FROM Marks m
JOIN Students s ON m.student_id = s.student_id
GROUP BY s.student_id;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('Sarathy', Decimal('83.6667'))]

In [20]:
%%sql
SELECT s.name, COUNT(*) AS present_days
FROM Attendance a
JOIN Students s ON a.student_id = s.student_id
WHERE a.status = 'Present'
GROUP BY s.student_id;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('Sarathy', 2)]

In [22]:
%%sql
SELECT sub.subject_name, m.marks_obtained
FROM Marks m
JOIN Subjects sub ON m.subject_id = sub.subject_id
JOIN Students s ON m.student_id = s.student_id
WHERE s.name = 'Sarathy'
ORDER BY m.marks_obtained DESC
limit 1;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('English', 91)]